Python/learning/PythonForDigitalHumanities/contents.tex
% Created 2022-11-18 Fri 01:07
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{Theena Kumaragurunathan}
\date{Fri Nov 18 12:16:00 AM +0530 2022}
\title{Python for Digital Humanities}
\hypersetup{
 pdfauthor={Theena Kumaragurunathan},
 pdftitle={Python for Digital Humanities},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 27.1 (Org mode 9.3)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents


\section{Lesson 1 INTRODUCTION TO PYTHON FOR DIGITAL HUMANITIES}
\label{sec:orgdfb8f5f}
\subsection{Resources}
\label{sec:org6359d6f}
This notebook is based on lessons found here: \href{https://pythonhumanities.com/}{Python For Humanities}
\subsection{Requirements}
\label{sec:org72028de}
\subsection{Acknowledgements}
\label{sec:orgbe4ed80}
\section{PART 1 WORKING WITH DATA IN PYTHON SCRIPTS}
\label{sec:org876d0b9}
\subsection{Lesson 2: Story Data in PYthon Script}
\label{sec:orgf7efd25}
\subsection{Lesson 3: Interacting with Strings in a Python Script}
\label{sec:org07c6911}
\subsection{Lesson 4: Interacting with Numbers in Python (Integers and Floats)}
\label{sec:org82c9e2b}
\section{PART 2 DATA STRUCTURES IN PYTHON}
\label{sec:org2c46c6e}
\subsection{Lesson 5: Creating and Working with Types in Python}
\label{sec:org14f7afc}
\subsection{Lesson 6: Creating and Working with Lists in Python}
\label{sec:org1223ae9}
\subsection{Lesson 7: Creating and Working with Dictionaries in Python}
\label{sec:org03e18fb}
\section{PART 3 INTERACTING WITH DATA STRUCTURES IN PYTHON}
\label{sec:org8c6c262}
\subsection{Lesson 8: Python Conditionals}
\label{sec:org4981fa4}
\subsection{Lesson 9: Python Loops}
\label{sec:org5d6b78b}
\subsection{Lesson 10: Python Functions}
\label{sec:org86dc8cc}
\subsection{Lesson 11: Python Classes}
\label{sec:orgfae9d03}
\section{PART 4 WORKING WITH TEXT DATA}
\label{sec:orgccf5aef}
\subsection{Lesson 12: Python and Text Files}
\label{sec:orgeb8c943}
\subsection{Lesson 13: Python and Modules and Libraries}
\label{sec:org626a38e}
\subsection{Lesson 14: Working with Regex Library (1)}
\label{sec:org639f7d0}
\subsection{Lesson 15: Working With Regex Library (2)}
\label{sec:orgec977af}
\section{PART 5 PYTHON AND WORKING WITH DATA STORED IN EXCEL}
\label{sec:org87b773d}
\subsection{Lesson 16: Reading Data from Excel Using the XLRD Library}
\label{sec:org25bbac4}
\subsection{Lesson 17: Searching Data Imported from Excel}
\label{sec:org6ed2cbe}
\subsection{Lesson 18: Writing Data to Excel Files using the XLSWXWRITER Library}
\label{sec:orge5c126e}
\section{PART 6 PYTHON AND WORKING WITH DATA FROM THE WEB}
\label{sec:orga9c4658}
\subsection{Lesson 19: Finding HTML Code from a website}
\label{sec:org35d098a}
\subsection{Lesson 20: Using the Python Library Requests to Interact with a Website}
\label{sec:org1a053f0}
\subsection{Lesson 21: Using the Python Library Beautiful Soup to Rip Data from a Website}
\label{sec:org2d9e8f4}
\section{PART 7 PYTHON AND WAYS TO STORE DATA}
\label{sec:org99b38b1}
\subsection{Lesson 22: Storing Data in Text Files}
\label{sec:org00e1949}
\subsection{Lesson 23: Storing Data in XML Files}
\label{sec:orgc83ee79}
\end{document}
